Revit 2027 API
ParameterTypeId.ProfileParamAlongPath Property
 "Parameter along path"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ProfileParamAlongPath { get; }
Public Shared ReadOnly Property ProfileParamAlongPath As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ProfileParamAlongPath {
	ForgeTypeId^ get ();
}
static member ProfileParamAlongPath : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace